In [2]:
import pandas as pd

In [3]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
index_s = ['a','b','c','d','e']
ser = pd.Series([1,2,3,4,5], index=index_s)
ser[0], ser['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_19764\3412011199.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['a']

(np.int64(1), np.int64(1))

In [5]:
# dictionary
ser2 = pd.Series([10, 'banana'])
dict_data = {'a':1,'b':2, 'c':3, 'd':4}

In [6]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])


population['서울']
population[['서울','부산']]

서울    9776
부산    2729
dtype: int64

In [7]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [8]:
# 숫자         
ser.iloc[0], ser,loc['a']

NameError: name 'loc' is not defined

In [9]:
# 한꺼번에 표현하고 싶을 떄 dataframe을 쓴다
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [10]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [11]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [12]:
# 시리즈 꺼내기 
scientists['Name']

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [13]:
# 슬라이싱 [시작행:끝행, 시작열:끝열] #쉼표는 행과 열, 차원을 구분 
scientists.iloc[:,0:1]

                Name
0  Rosaline Franklin
1     William Gosset

In [ ]:
scientists.index = ['Rosaline Franklin','William Gosset']

In [ ]:
# 인덱스로 행 추출하기 
scientists.loc['Rosaline Franklin']

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: Rosaline Franklin, dtype: object

lioc[] : index locator  숫자를 넣어서 꺼내기 
loc[] : locator

In [ ]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
df = pd.DataFrame(data, columns=['A', 'B', 'C'])

df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [18]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [20]:
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [21]:
sci1.loc[0,'Name'] #row, column

'Rosaline Franklin'

In [25]:
sci1.iloc[1,-1]

np.int64(61)

In [29]:
sci1.iloc[:,2:4]

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16

In [31]:
sci1.loc[:,'Occupation']

0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [17]:
sci1.loc[0,'Occupation']

'Chemist'

In [ ]:
sci1.to_csv('./data/scientist_1.csv')

In [ ]:
#remove index
sci1.to_csv('./data/scientist_2.csv', index=False)

In [ ]:
df = pd.read_csv("./data/scientist_2.csv")
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [ ]:
#판다스로 csv 파일 읽어오기 
df = pd.read_csv('./data/scientists.csv')

In [ ]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
# pickle: 파이썬의 객체형을 저장
sci1.to_pickle('./data/scientists.pickle')

In [ ]:
#pickle은 피클로 읽어 함
df2 = pd.read_pickle('./data/scientists.pickle')

In [ ]:
df1=df

In [ ]:
df.info()
#null/non-null, type 중요

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

# 데이터 미리보기

info()   
head/tail()

In [ ]:
#head 함수 기본 5개 
# (숫자) _ 안에 숫자 넣어서 조정 
df.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [ ]:
# 기술 통계를 낼 수 있는 column들만 뽑아서 

df1.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [ ]:
df1.loc[:,'Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [34]:
# 데이터 프레임 생성 
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}

df_scores = pd.DataFrame(data)

In [35]:
df_scores.head(), df_scores.tail()

(    이름  나이  점수
 0  김철수  25  85
 1  이영희  28  92
 2  박민수  22  78
 3  정수진  31  95
 4  최영호  27  88,
     이름  나이  점수
 2  박민수  22  78
 3  정수진  31  95
 4  최영호  27  88
 5  한미래  24  73
 6  윤지원  29  91)

In [85]:

# 행/열 이름 바꾸기 

df_scores.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']

df_scores.columns = ['name', 'age', 'score']

# 일부만 바꾸기 .rename()
df_scores.rename(columns={'이름': 'Name', '나이': 'Age', '점수': 'Score'})
df_scores.rename(index={"A":"a", "B": "b"})
df_scores

ValueError: Length mismatch: Expected axis has 8 elements, new values have 7 elements

In [86]:
# 원본은 변하지 않음 
# df_scores.rename(index["A",'a']), inplace=True # 원본을 바꿈 , return이 없음

In [87]:
df1.shape

NameError: name 'df1' is not defined

In [47]:
df_scores.iloc[0:2]

  name  age  score
A  김철수   25     85
B  이영희   28     92

In [49]:
df_scores[df_scores['age']>25]

  name  age  score
B  이영희   28     92
D  정수진   31     95
E  최영호   27     88
G  윤지원   29     91

In [50]:
df_scores[df_scores['score']>90]

  name  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [ ]:
# 행 주가 
df_scores.loc[7] = ['홍길동', 30, 50]

df_scores

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91
7  홍길동   30     50

In [88]:
df_scores['grade'] = ['A','B','C','D','E','F','G','H']
df_scores['등급'] = ['A','B','C','D','E','F','G','H']

print(df_scores)

df_scores.rename(columns={'grade': '등급'},inplace=True)
print(df_scores)
df_scores = df_scores.drop(df_scores.columns[5], axis=1)
print(df_scores)

  name  s_id  age  score grade 등급
A  김철수  S001   25     85     A  A
B  이영희  S002   28     92     B  B
C  박민수  S003   22     78     C  C
D  정수진  S004   31     95     D  D
E  최영호  S005   27     88     E  E
F  한미래  S006   24     73     F  F
G  윤지원  S007   29     91     G  G
7  홍길동  5008   30     50     H  H
  name  s_id  age  score 등급 등급
A  김철수  S001   25     85  A  A
B  이영희  S002   28     92  B  B
C  박민수  S003   22     78  C  C
D  정수진  S004   31     95  D  D
E  최영호  S005   27     88  E  E
F  한미래  S006   24     73  F  F
G  윤지원  S007   29     91  G  G
7  홍길동  5008   30     50  H  H
  name  s_id  age  score
A  김철수  S001   25     85
B  이영희  S002   28     92
C  박민수  S003   22     78
D  정수진  S004   31     95
E  최영호  S005   27     88
F  한미래  S006   24     73
G  윤지원  S007   29     91
7  홍길동  5008   30     50

In [ ]:

df_scores.insert(loc=1, column='s_id',value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', '5008'])

ValueError: cannot insert s_id, already exists

In [84]:
print(df_scores)
df_scores.rename(columns={'grade': '등급'},inplace=True)
print(df_scores)
df_scores = df_scores.drop(df_scores.columns[5], axis=1)
print(df_scores)

  name  s_id  age  score
A  김철수  S001   25     85
B  이영희  S002   28     92
C  박민수  S003   22     78
D  정수진  S004   31     95
E  최영호  S005   27     88
F  한미래  S006   24     73
G  윤지원  S007   29     91
7  홍길동  5008   30     50
  name  s_id  age  score
A  김철수  S001   25     85
B  이영희  S002   28     92
C  박민수  S003   22     78
D  정수진  S004   31     95
E  최영호  S005   27     88
F  한미래  S006   24     73
G  윤지원  S007   29     91
7  홍길동  5008   30     50

IndexError: index 5 is out of bounds for axis 0 with size 4

In [63]:
# 인덱스로 행 삭제
df_scores.drop('A', axis=0)  # 'A' 인덱스의 행 삭제

  name  s_id  age  score grade
B  이영희  S002   28     92     B
C  박민수  S003   22     78     C
D  정수진  S004   31     95     D
E  최영호  S005   27     88     E
F  한미래  S006   24     73     F
G  윤지원  S007   29     91     G
7  홍길동  5008   30     50     H

In [67]:
# 열 이름으로 열 삭제
df_scores.drop('grade', axis=1)  # 'grade' 열 삭제

  name  s_id  age  score
A  김철수  S001   25     85
B  이영희  S002   28     92
C  박민수  S003   22     78
D  정수진  S004   31     95
E  최영호  S005   27     88
F  한미래  S006   24     73
G  윤지원  S007   29     91
7  홍길동  5008   30     50

In [93]:
df_new = df_scores.set_index('s_id')
df_new.index

Index(['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', '5008'], dtype='object', name='s_id')

In [ ]:
dr = pd.date_range('2025-06-01', periods=8) # d가 디폴트
df_new['date'] = dr
df_new1 = df_new.set_index('date')
df_new1

           name  age  score
date
2025-06-01  김철수   25     85
2025-06-02  이영희   28     92
2025-06-03  박민수   22     78
2025-06-04  정수진   31     95
2025-06-05  최영호   27     88
2025-06-06  한미래   24     73
2025-06-07  윤지원   29     91
2025-06-08  홍길동   30     50

In [104]:
df_new1.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 8 entries, 2025-06-01 to 2025-06-08
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   age     8 non-null      int64
 2   score   8 non-null      int64
dtypes: int64(2), object(1)
memory usage: 256.0+ bytes